# # 3-polytope
# interpolation_weights(::Type{<:Tetrahedron}, r, s, t) = Vec((1 - r - s - t), r, s, t)
# interpolation_weights(::Type{<:Hexahedron},  r, s, t) = Vec((1 - r)*(1 - s)*(1 - t),
#                                                             (    r)*(1 - s)*(1 - t),
#                                                             (    r)*(    s)*(1 - t),
#                                                             (1 - r)*(    s)*(1 - t),
#                                                             (1 - r)*(1 - s)*(    t),
#                                                             (    r)*(1 - s)*(    t),
#                                                             (    r)*(    s)*(    t),
#                                                             (1 - r)*(    s)*(    t))
# function interpolation_weights(::Type{<:QuadraticTetrahedron}, r, s, t)
#     u = 1 - r - s - t
#     return Vec((2u-1)u,
#                (2r-1)r,
#                (2s-1)s,
#                (2t-1)t,
#                   4u*r,
#                   4r*s,
#                   4s*u, 
#                   4u*t,
#                   4r*t,
#                   4s*t)
# end
# function interpolation_weights(::Type{<:QuadraticHexahedron}, r, s, t)
#     ξ = 2r - 1; η = 2s - 1; ζ = 2t - 1
#     return Vec((1 - ξ)*(1 - η)*(1 - ζ)*(-2 - ξ - η - ζ)/8,
#                (1 + ξ)*(1 - η)*(1 - ζ)*(-2 + ξ - η - ζ)/8,
#                (1 + ξ)*(1 + η)*(1 - ζ)*(-2 + ξ + η - ζ)/8,
#                (1 - ξ)*(1 + η)*(1 - ζ)*(-2 - ξ + η - ζ)/8,
#                (1 - ξ)*(1 - η)*(1 + ζ)*(-2 - ξ - η + ζ)/8,
#                (1 + ξ)*(1 - η)*(1 + ζ)*(-2 + ξ - η + ζ)/8,
#                (1 + ξ)*(1 + η)*(1 + ζ)*(-2 + ξ + η + ζ)/8,
#                (1 - ξ)*(1 + η)*(1 + ζ)*(-2 - ξ + η + ζ)/8,
#                           (1 - ξ^2)*(1 - η  )*(1 - ζ  )/4,
#                           (1 + ξ  )*(1 - η^2)*(1 - ζ  )/4,
#                           (1 - ξ^2)*(1 + η  )*(1 - ζ  )/4,
#                           (1 - ξ  )*(1 - η^2)*(1 - ζ  )/4,
#                           (1 - ξ^2)*(1 - η  )*(1 + ζ  )/4,
#                           (1 + ξ  )*(1 - η^2)*(1 + ζ  )/4,
#                           (1 - ξ^2)*(1 + η  )*(1 + ζ  )/4,
#                           (1 - ξ  )*(1 - η^2)*(1 + ζ  )/4,
#                           (1 - ξ  )*(1 - η  )*(1 - ζ^2)/4,
#                           (1 + ξ  )*(1 - η  )*(1 - ζ^2)/4,
#                           (1 + ξ  )*(1 + η  )*(1 - ζ^2)/4,
#                           (1 - ξ  )*(1 + η  )*(1 - ζ^2)/4)
# end
